---
kind: type
id: T:Autodesk.Revit.DB.Visual.MetallicPaint
source: html/fee435aa-5e3f-14c6-1566-5c8fd2d63eb8.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint

A static class that provides access to the property names that appear in the MetallicPaint visual asset schema.

## Syntax (C#)
```csharp
public static class MetallicPaint
```